Revit 2023 API
ATFBaseExportOptions Members
The ATFBaseExportOptions type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the ATFBaseExportOptions
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
ViewId
 The element id of the 3D view to export. InvalidElementId by default.
See Also
ATFBaseExportOptions Class
Autodesk.Revit.DB Namespace